<h1 class="entry-title"><span >Como ser um programador freelancer de sucesso</span></h1>
<p><span >Uma carreira como freelancer &eacute; a realidade de 35% da for&ccedil;a de trabalho dos Estados Unidos.</span>&nbsp;<span >Ele &eacute; projetado para pessoas que desejam mais liberdade, ou sentem que trabalhar para um empregador limita sua capacidade de ser criativo.</span></p>
<p><span >Freelancing &eacute; uma op&ccedil;&atilde;o vi&aacute;vel para programadores interessados ​​em ganhar renda adicional enquanto estiverem empregados ou iniciar um neg&oacute;cio em tempo integral no futuro.</span>&nbsp;<span >Ambas s&atilde;o op&ccedil;&otilde;es vi&aacute;veis ​​com diferencia&ccedil;&atilde;o entre renda ativa (trabalho) e renda passiva (n&atilde;o trabalhando para auferir renda).</span></p>
<p><span >Este artigo &eacute; um guia de &ldquo;melhores pr&aacute;ticas&rdquo; para transformar um hobby ou paix&atilde;o de programa&ccedil;&atilde;o em um&nbsp;<a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=https://simpleprogrammer.com/freelancing-business&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhjs17QtotE7t7rvZw_HhROq_mQqoQ" target="_blank" rel="noopener">neg&oacute;cio aut&ocirc;nomo</a>&nbsp;.</span></p>
<h2><span >Os benef&iacute;cios do freelancer</span></h2>
<p><span >A flexibilidade de trabalhar em um caf&eacute; ou em casa &eacute; uma conveni&ecirc;ncia dispon&iacute;vel para qualquer freelancer, mas os programadores podem se encontrar com algumas vantagens exclusivas.</span>&nbsp;<span >Eu cubro os benef&iacute;cios espec&iacute;ficos abaixo para programadores freelancers.</span></p>
<h3><span >Abund&acirc;ncia do Trabalho</span></h3>
<p><span >Uma vantagem de ser um programador freelancer &eacute; a abund&acirc;ncia de trabalho no mercado.</span>&nbsp;<span >No entanto, h&aacute; uma escassez de programadores freelancing na ind&uacute;stria.</span>&nbsp;<span >Como resultado, isso abre a porta para gerenciar um volume consistente de trabalho.</span></p>
<p><span >Alguns exemplos de habilidades que um desenvolvedor precisa para ter sucesso incluem SQL, C # e JavaScript.</span>&nbsp;<span >Agora &eacute; um hor&aacute;rio nobre para os programadores envolverem-se em freelancers para que possam atender &agrave;s necessidades de clientes individuais por contrato ou por uma &uacute;nica vez.</span></p>
<h3><span >Treinamento Cont&iacute;nuo</span></h3>
<p><span >Os programadores t&ecirc;m a liberdade de escolher certos tipos de novos projetos.</span>&nbsp;<span >Portanto, voc&ecirc; tamb&eacute;m pode aprender habilidades necess&aacute;rias no desenvolvimento de aplicativos, JEE ou Python para assumir trabalhos mais diversos.</span>&nbsp;<span >Como resultado, voc&ecirc; pode aumentar o potencial de ganhos tornando-se um programador que executa trabalhos sob demanda de alta qualidade.</span></p>
<h2><span >Programa&ccedil;&atilde;o Freelance Part-Time ou Full-Time?</span></h2>
<p><span >Voc&ecirc; pode ser um programador freelancer em tempo integral?</span>&nbsp;<span >Absolutamente.</span>&nbsp;<span >Mesmo assim, esteja ciente de que trabalhar sozinho exige autodisciplina, estrat&eacute;gias de marketing eficazes, excelente atendimento ao cliente e est&iacute;mulo aos clientes existentes para mant&ecirc;-los a longo prazo.</span></p>
<p><span >Voc&ecirc; trabalha em outro emprego?</span>&nbsp;<span >N&atilde;o desanime.</span>&nbsp;<span >&Eacute; comum que freelancers sejam empregados enquanto mant&ecirc;m seus pr&oacute;prios neg&oacute;cios.</span>&nbsp;<span >Esses profissionais t&ecirc;m fam&iacute;lias, mant&ecirc;m suas fam&iacute;lias e conseguem crescer seus neg&oacute;cios com disciplina.</span></p>
<p><span >Eu recomendo fortemente que voc&ecirc; fa&ccedil;a essa pergunta a si mesmo antes de decidir deixar um emprego em tempo integral.</span>&nbsp;<span >Se for bem-sucedido, seus servi&ccedil;os podem ser solicitados at&eacute; o ponto em que recusar clientes &eacute; a norma &agrave; medida que voc&ecirc; trabalha em um emprego de per&iacute;odo integral.</span>&nbsp;<span >Em contraste, o crescimento do neg&oacute;cio pode ser a solu&ccedil;&atilde;o para a felicidade profissional.</span></p>
<p><span >Voc&ecirc; tem uma fam&iacute;lia?</span>&nbsp;<span >Fale com seu c&ocirc;njuge e filhos sobre a realidade de trabalhar em casa.</span></p>
<p><span >Aqui est&aacute; uma lista de itens para revisar antes de voc&ecirc; entrar em um neg&oacute;cio freelance em tempo integral:</span></p>
<ul>
    <li><span >Defina uma renda anual ideal para cuidar de despesas pessoais e de neg&oacute;cios.</span></li>
    <li><span >Evite definir uma linha do tempo, porque se a meta n&atilde;o for cumprida, isso pode levar &agrave; decep&ccedil;&atilde;o.</span></li>
    <li><span >Calcular as despesas e vantagens fiscais de loca&ccedil;&atilde;o de um espa&ccedil;o de escrit&oacute;rio ou trabalhar em casa.</span></li>
</ul>
<p><span >Se a motiva&ccedil;&atilde;o &eacute; ganhar uma renda adicional ou criar um neg&oacute;cio completo, voc&ecirc; deve considerar os pontos acima antes de dar o pr&oacute;ximo passo.</span></p>
<h2><span >Concentre-se em um nicho</span></h2>
<p><span >No mundo freelance, existem&nbsp;<a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=https://en.wikipedia.org/wiki/Generalist_and_specialist_species&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhiMAnZ_wkoUoH9IEMYZGCwj6A0fHg" target="_blank" rel="noopener">generalistas e especialistas</a>&nbsp;.</span>&nbsp;<span >Um programador generalista geralmente assume todas as atribui&ccedil;&otilde;es de programa&ccedil;&atilde;o em v&aacute;rios setores.</span>&nbsp;<span >A desvantagem disso &eacute; que voc&ecirc; pode ser visto como um freelancer que &eacute; novo no assunto, o que resulta em uma taxa baixa ou inicial.</span></p>
<p><span >Pelo contr&aacute;rio, um especialista &eacute; um programador de computador que trabalhou em um setor espec&iacute;fico - como o setor imobili&aacute;rio - por cinco ou mais anos, ou algu&eacute;m que tenha conhecimento de um conjunto espec&iacute;fico de habilidades ou linguagem de programa&ccedil;&atilde;o, como o PHP.</span></p>
<p><span >A vantagem de ser um especialista &eacute; que suas taxas podem ser aumentadas devido ao valor que voc&ecirc; pode oferecer ao cliente.</span>&nbsp;<span >Cabe a voc&ecirc; se concentrar em habilidades e talentos que as empresas em potencial desejam em um desenvolvedor freelancer e que voc&ecirc; tenha o melhor desempenho.</span>&nbsp;<span >Quanto mais voc&ecirc; deixar as empresas mais felizes, maior ser&aacute; a probabilidade de elas se referirem a empresas semelhantes.</span></p>
<p><span >Para ajud&aacute;-lo a aproveitar os empregos dispon&iacute;veis no mercado, aqui est&aacute; uma lista de trabalhos comuns de programadores para encontrar em sites independentes:</span></p>
<ul>
    <li><span >Desenvolva aplicativos para dispositivos m&oacute;veis.</span></li>
    <li><span >Projete o aplicativo baseado em Oracle APEX.</span></li>
    <li><span >C&oacute;digo WordPress e PHP.</span></li>
    <li><span >Otimize sites de com&eacute;rcio eletr&ocirc;nico.</span></li>
    <li><span >Desenvolva bot para automa&ccedil;&atilde;o.</span></li>
    <li><span >Resolva problemas de CSS, JS e MySQL.</span></li>
</ul>
<p><span >Depois de descobrir quais servi&ccedil;os oferecer, o pr&oacute;ximo passo &eacute; entender completamente a demografia de seu mercado-alvo.</span>&nbsp;<span >Embora esses trabalhos possam ser abordados por generalistas ou especialistas, &eacute; melhor ser um especialista.</span></p>
<h2><span >Conhe&ccedil;a o seu p&uacute;blico-alvo</span></h2>
<p><span >Os principais freelancers de programa&ccedil;&atilde;o de software sabem exatamente quais servi&ccedil;os seus p&uacute;blicos-alvo desejam.</span>&nbsp;<span >Para ser um freelancer de sucesso, voc&ecirc; precisar&aacute; come&ccedil;ar a entender a demografia de seu p&uacute;blico ideal, que inclui sexo, idade, cargo, local e setor.</span></p>
<p><span >Por exemplo, uma programadora freelancer feminina, inspirada pela organiza&ccedil;&atilde;o Women Who Code, pode recrutar garotas e mulheres para empregos STEM.</span>&nbsp;<span >O p&uacute;blico-alvo pode ser do sexo feminino, com idades entre 18 e 32 anos, iniciantes e novatos, localizados em sua cidade ou estado, e procurando entrar no setor de tecnologia.</span>&nbsp;<span >Quando essas informa&ccedil;&otilde;es forem confirmadas, os produtos e servi&ccedil;os que voc&ecirc; fornecer poder&atilde;o ser adaptados ao que o consumidor m&eacute;dio deseja.</span></p>
<p><span >Aqui est&aacute; uma lista de maneiras pelas quais essas informa&ccedil;&otilde;es podem ajudar:</span></p>
<ul>
    <li><span >Desenvolver conte&uacute;do de marketing que se conectar&aacute; com o p&uacute;blico com base em seus valores.</span></li>
    <li><span >Projetando produtos que consertar&atilde;o os problemas de um cliente.</span></li>
    <li><span >Comunicar com o seu p&uacute;blico-alvo com base nas plataformas sociais ou m&eacute;todos de comunica&ccedil;&atilde;o que eles usam.</span></li>
</ul>
<p><span >A id&eacute;ia principal &eacute; conectar seu p&uacute;blico a seus servi&ccedil;os com a ajuda de e-mails, boletins eletr&ocirc;nicos, m&iacute;dias sociais, blogs, YouTube ou ser um apresentador em um evento local.</span></p>
<h2><span >Personalize sua marca</span></h2>
<p><span >Os programadores freelancers de sucesso entendem que as pessoas fazem neg&oacute;cios com empreendedores que eles admiram ou gostam.</span>&nbsp;<span >Isso significa que o freelancer estabelece um padr&atilde;o de atendimento ao cliente com uma personalidade comercial - as habilidades interpessoais para trabalhar com sucesso com pessoas de diversas origens.</span></p>
<p><span ><a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=https://simpleprogrammer.com/personal-brand-reputation/&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhgY551kzKIfghMkg5KqUBX8Cr12wA" target="_blank" rel="noopener">Personal branding</a>&nbsp;consiste em compartilhar parte da sua vida em m&iacute;dias sociais como Instagram, postar fotos de voc&ecirc; trabalhando em projetos ou compartilhar os destaques de uma viagem de neg&oacute;cios.</span>&nbsp;<span >Pode incluir o in&iacute;cio de um canal do YouTube de pr&aacute;ticas recomendadas sobre como depurar ou gravar programas ou outro software com efici&ecirc;ncia.</span></p>
<p><span >&Eacute; uma oportunidade para mostrar aos clientes, potenciais clientes e seguidores um dia na vida de um programador freelancer.</span>&nbsp;<span >Isso aumentar&aacute; a confian&ccedil;a das pessoas em alcan&ccedil;ar voc&ecirc; para um projeto pago, al&eacute;m de torn&aacute;-lo mais compreens&iacute;vel ao seu mercado-alvo, &agrave; medida que voc&ecirc; cria um relacionamento com eles.</span></p>
<p><span >Um exemplo de um programador de sucesso &eacute;&nbsp;<a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=https://twitter.com/saronyitbarek&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhh1OzmnyoVqP5UY0PEGI97tracuBA" target="_blank" rel="noopener">Saron Yitbare</a>&nbsp;, o fundador da CodeNewbie.</span>&nbsp;<span >Nas m&iacute;dias sociais, ela compartilha momentos de escrever posts em blogs, v&iacute;deos de seu discurso em p&uacute;blico e Tweets do feedback de seu p&uacute;blico.</span></p>
<h2><span >Construa nova clientela</span></h2>
<p><span >Como um programador tentando freelancer pela primeira vez, voc&ecirc; pode estar se perguntando onde conseguir o seu neg&oacute;cio inicial.</span>&nbsp;<span >Como voc&ecirc; come&ccedil;a a construir um portf&oacute;lio para atrair clientes mais desej&aacute;veis?</span>&nbsp;<span >Voc&ecirc; pode certamente puxar de amigos ou contatos na ind&uacute;stria, mas voc&ecirc; vai querer garantir o seu trabalho, e &eacute; a&iacute; que entram os sites freelance.</span></p>
<p><span >O benef&iacute;cio de usar sites independentes &eacute; o site atua como um mediador entre voc&ecirc; e o cliente em rela&ccedil;&atilde;o a disputas, pagamento e escopo do trabalho.</span>&nbsp;<span >Se voc&ecirc; trabalha sozinho sem um site de mediador, ele abre a porta para n&atilde;o ser pago pelo trabalho e por outros problemas comuns.</span>&nbsp;<span >Aqui est&atilde;o algumas maneiras de encontrar os clientes convenientemente:</span></p>
<ul>
    <li><span ><strong>Sites freelancers:</strong>&nbsp;<a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=http://freelancemyway.com/&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhib9GXEFMNOruCzAbvursu4YD0R_A" target="_blank" rel="noopener">Freelancer</a>&nbsp;,&nbsp;<a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=https://www.freelancer.com/&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhjP-OHYV6N9gS8ece33Q4wNdyXIYg" target="_blank" rel="noopener">Freelancer</a>&nbsp;e&nbsp;<a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=https://talent.hubstaff.com/&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhj7xQ7X1kVBGEpdPzqbRywsVjXqcA" target="_blank" rel="noopener">Hubstaff</a>&nbsp;.</span></li>
    <li><span ><strong>Site profissional:</strong>&nbsp;seu site pessoal equipado com palavras-chave (SEO) para que as pessoas na sua regi&atilde;o possam encontr&aacute;-lo.</span></li>
</ul>
<p><span >&Eacute; essencial equilibrar seu relacionamento com clientes em potencial.</span>&nbsp;<span >Lembre-se de ser transparente ao definir sua agenda para definir a expectativa do n&uacute;mero de atribui&ccedil;&otilde;es que voc&ecirc; pode realisticamente completar.</span></p>
<h2><span >Defina seus pr&oacute;prios padr&otilde;es</span></h2>
<p><span >Ao come&ccedil;ar, pode ser atraente aceitar qualquer trabalho que chegue &agrave; sua caixa de entrada.</span>&nbsp;<span >Pode incluir uma empresa que n&atilde;o pode fornecer um escopo de trabalho, um cliente que demonstra falta de respeito ou uma proposta escrita n&atilde;o profissionalmente.</span>&nbsp;<span >Eu recomendo estabelecer padr&otilde;es aumentando o portf&oacute;lio.</span></p>
<p><span >Aqui est&aacute; uma lista de maneiras de come&ccedil;ar a estabelecer padr&otilde;es para um neg&oacute;cio aut&ocirc;nomo:</span></p>
<ul>
    <li><span >Defina uma taxa por hora ou por projeto, definindo um intervalo de pagamento para ganhar o que voc&ecirc; merece.</span>&nbsp;<span >(A pr&oacute;xima se&ccedil;&atilde;o entrar&aacute; em mais detalhes.)</span></li>
    <li><span >Selecione um nicho para ganhar reputa&ccedil;&atilde;o por um conjunto espec&iacute;fico de habilidades.</span></li>
    <li><span >Evite trabalhar em projetos com os quais voc&ecirc; n&atilde;o esteja familiarizado para evitar um trabalho insatisfat&oacute;rio.</span>&nbsp;<span >(Se voc&ecirc; n&atilde;o conhece o Python, n&atilde;o aceite um trabalho que exija que voc&ecirc; corrija um erro de codifica&ccedil;&atilde;o do Python ou cometa o erro de pensar que voc&ecirc; pode aprender o que quiser.)</span></li>
</ul>
<p><span >Uma vez definido um padr&atilde;o de excel&ecirc;ncia, voc&ecirc; ter&aacute; a vantagem de escolher as atribui&ccedil;&otilde;es.</span>&nbsp;<span >Uma boa maneira de descobrir a taxa padr&atilde;o para um profissional em sua &aacute;rea &eacute; entrar em contato com v&aacute;rios programadores freelancers para uma s&eacute;rie de taxas.</span></p>
<h2><span >Defina suas taxas e cumpri-las</span></h2>
<p><span >Um novo desenvolvedor freelancer pode se sentir obrigado a aceitar todos os clientes reduzindo sua taxa por hora ou por projeto para tarefas.</span>&nbsp;<span >Eu recomendo fortemente descobrir a taxa padr&atilde;o para programadores em sua localiza&ccedil;&atilde;o geogr&aacute;fica, para evitar subestimar suas habilidades.</span></p>
<p><span >Um programador freelancer ganha entre US $ 28 e US $ 200 por hora.</span>&nbsp;<span >&Eacute; uma boa ideia adicionar um segundo conjunto de habilidades para aumentar sua renda.</span>&nbsp;<span >Aqui est&atilde;o alguns fatores que influenciam as taxas de configura&ccedil;&atilde;o:</span></p>
<ul>
    <li><span ><strong>Experi&ecirc;ncia e portf&oacute;lio:</strong>&nbsp;Vamos enfrent&aacute;-lo: os clientes geralmente pagam com base nos anos de experi&ecirc;ncia de um freelancer, na qualidade de seu portf&oacute;lio e em suas conex&otilde;es com marcas conceituadas.</span></li>
    <li><span ><strong>Servi&ccedil;os sob demanda:</strong>&nbsp;se voc&ecirc; puder se posicionar como um programador sob demanda, isso aumentar&aacute; o desejo de uma empresa de pagar taxas mais altas.</span></li>
    <li><span ><strong>Habilidades de negocia&ccedil;&atilde;o:</strong>&nbsp;Um novo freelancer com confian&ccedil;a na negocia&ccedil;&atilde;o pode ganhar uma taxa maior se o acordo criar uma situa&ccedil;&atilde;o vantajosa para todos.</span></li>
</ul>
<p><span >Os programadores podem melhorar ainda mais sua demanda e suas habilidades, dedicando tempo e esfor&ccedil;o &agrave; autodidata, a uma institui&ccedil;&atilde;o p&oacute;s-secund&aacute;ria ou a um programa de curso on-line.</span></p>
<h2><span >Take It Offline</span></h2>
<p><span >M&iacute;dias sociais, um site profissional e marketing on-line s&atilde;o essenciais.</span>&nbsp;<span >No entanto, s&atilde;o as experi&ecirc;ncias off-line que ajudam um neg&oacute;cio a se expandir.</span>&nbsp;<span >As atividades off-line que podem ajudar a expandir seu neg&oacute;cio de&nbsp;<a href="https://translate.googleusercontent.com/translate_c?depth=1&amp;hl=pt-BR&amp;prev=search&amp;rurl=translate.google.com&amp;sl=en&amp;sp=nmt4&amp;u=https://simpleprogrammer.com/become-freelancer-software-developer&amp;xid=17259,15700002,15700021,15700186,15700190,15700256,15700259,15700262,15700265&amp;usg=ALkJrhjB4hy_DoN7S8Dc_UHZ5aztcAprsw" target="_blank" rel="noopener">programador de software</a>&nbsp;freelancer incluem:</span></p>
<ul>
    <li><span >Hospedando encontros de neg&oacute;cios para se conectar com empreendedores que possam precisar de seus servi&ccedil;os.</span></li>
    <li><span >Participar de semin&aacute;rios de programadores de computador para interagir com outros programadores.</span></li>
    <li><span >Leasing de um espa&ccedil;o de est&uacute;dio ou espa&ccedil;o de co-trabalho para atender os funcion&aacute;rios em potencial (ou seja, escritores ou fot&oacute;grafos) para expandir seus neg&oacute;cios.</span></li>
</ul>
<p><span >Leve o seu neg&oacute;cio offline para crescer o neg&oacute;cio atrav&eacute;s da palavra da boca na comunidade.</span><span >Enquanto isso, mantenha-se ativo no LinkedIn, participe de fun&ccedil;&otilde;es de rede ou anuncie sua empresa on-line para garantir que seu conte&uacute;do e seus neg&oacute;cios permane&ccedil;am atualizados enquanto voc&ecirc; alcan&ccedil;a mais clientes em potencial em sua &aacute;rea.</span></p>
<h2><span >Tomando o salto para Freelancing</span></h2>
<p><span >Um neg&oacute;cio aut&ocirc;nomo exige um trabalho que inclua uma programa&ccedil;&atilde;o di&aacute;ria de marketing, gerenciamento de m&iacute;dia social, tarefas administrativas, faturamento, atendimento a clientes em pessoa e entrega de trabalho de alta qualidade.</span>&nbsp;<span >A maioria dos programadores freelancers pode definir suas pr&oacute;prias horas, escolher ou escolher clientes, trabalhar diretamente com executivos e construir uma conex&atilde;o com outros programadores no conforto de suas pr&oacute;prias casas.</span></p>
<p><span >Como freelancer, recomendo que voc&ecirc; busque esta oportunidade se sua paix&atilde;o pelo trabalho for de alto n&iacute;vel.</span>&nbsp;<span >Por que isso &eacute; importante?</span>&nbsp;<span >Se a paix&atilde;o n&atilde;o existe, a rejei&ccedil;&atilde;o ou outros desafios podem impedir uma pessoa de continuar a procurar oportunidades de freelance.</span></p>
<p><span >N&atilde;o &eacute; o caminho mais f&aacute;cil, mas para os programadores que querem buscar projetos mais criativos e serem seus pr&oacute;prios patr&otilde;es, esse pode ser o &uacute;nico caminho - que est&aacute; al&eacute;m de recompensar aqueles que s&atilde;o dedicados o suficiente para se esfor&ccedil;arem.</span></p>
<!-- #######  YAY, I AM THE SOURCE EDITOR! #########-->